{
  "backend/main.mo": "Empty Motoko actor with no implemented logic.",
  "feature_evidence.json": "Feature evidence report listing two inspection‑reset features and the files, components, and test IDs associated with them.",
  "frontend-file-summaries.txt": "JSON mapping of frontend file paths to short descriptions used for build planning.",
  "frontend/index.css": "Tailwind base styles defining light/dark OKLCH color tokens and applying global background/foreground variables.",
  "frontend/index.html": "HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Wraps the TimerScreen component in a theme provider with dark-mode defaults.",
  "frontend/src/components/EventSelector.tsx": "Dropdown for selecting WCA events, disabled during solves.",
  "frontend/src/components/ScramblePanel.tsx": "Card showing the current scramble with a button to request a new one.",
  "frontend/src/components/ScrambleVisualizer.tsx": "Loads a 2D puzzle visualization via cubing.js CDN and displays it based on event and scramble.",
  "frontend/src/components/SessionStats.tsx": "Card displaying session statistics such as current, best, ao5, ao12, and mo3.",
  "frontend/src/components/SolveHistory.tsx": "Scrollable grid displaying recent solves with DNF highlighting and formatted times.",
  "frontend/src/components/TimerDisplay.tsx": "Main timer UI showing inspection, running, and final result states with color and text cues, plus pointer start controls.",
  "frontend/src/components/TimerScreen.tsx": "Main timer screen handling event selection, scramble generation, solve timing, session persistence, and stats display.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the current Internet Identity, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication state and methods using Internet Identity, including login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file noting that backend queries are unused because scrambles are generated client‑side.",
  "frontend/src/hooks/useWcaScramble.ts": "Generates WCA scrambles via cubing.js and manages scramble state and loading.",
  "frontend/src/hooks/useWcaTimerControls.ts": "Implements full WCA‑style timer logic including inspection, timing, state transitions, and warning sounds.",
  "frontend/src/index.css": "Defines Tailwind base styles and a custom color theme for the timer, including light and dark modes.",
  "frontend/src/lib/inspectionAudio.ts": "Implements Web Audio API beeps for 8‑second and 5‑second inspection warnings.",
  "frontend/src/lib/sessionCookie.ts": "Saves and loads session data to a cookie, including event, scramble, and solve history.",
  "frontend/src/lib/sessionStats.ts": "Computes session statistics such as current time, best, ao5, ao12, and mo3 from solve history.",
  "frontend/src/lib/wcaEvents.ts": "Defines the WCAEvent interface and exports a list of supported WCA events with IDs, names, and scramble identifiers.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/types/cubing.d.ts": "Provides TypeScript type declarations for cubing.net scramble and twisty player modules.",
  "frontend/src/types/solves.ts": "Defines solve data types and utility functions for formatting and computing solve times with inspection outcomes.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme extensions, colors, animations, and plugins for the frontend.",
  "project_state.json": "Describes project metadata, existing issues, and feature requests related to resetting the inspection timer after solves."
}