{
  "backend/main.mo": "Actor manages user profiles with access control, allowing callers to view or save their own profile with admin overrides.",
  "backend/migration.mo": "Migration copies userProfiles from the old actor state to the new actor format.",
  "feature_evidence.json": "Feature evidence listing features, affected files, components, tests, and confidence metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of many frontend files.",
  "frontend/index.css": "Tailwind base styles defining light and dark theme color variables and global layout rules.",
  "frontend/index.html": "Minimal HTML shell mounting the React app and loading the main entry script.",
  "frontend/src/App.tsx": "Root component wrapping TimerScreen with a theme provider and no authentication.",
  "frontend/src/components/AccountModal.tsx": "Empty placeholder file for an account modal component.",
  "frontend/src/components/EventSelector.tsx": "Dropdown component for selecting a WCA event, driven by WCA_EVENTS metadata.",
  "frontend/src/components/LoginModal.tsx": "Empty placeholder file for a login modal component.",
  "frontend/src/components/practice/PracticeBrowseCompetitions.tsx": "Fetches and filters upcoming competitions with search and country filters, allowing users to pick one.",
  "frontend/src/components/practice/PracticeReady.tsx": "Shows selected event scrambles, navigation, regeneration, and persistence for practice mode.",
  "frontend/src/components/practice/PracticeScreen.tsx": "Controls the multi-step practice flow including competition browsing, event selection, and scramble view.",
  "frontend/src/components/practice/PracticeSelectEvent.tsx": "Loads competition details and lets the user pick an event allowed at that competition.",
  "frontend/src/components/ScramblePanel.tsx": "Card UI showing the current scramble with a refresh button and loading state.",
  "frontend/src/components/ScrambleVisualizer.tsx": "Loads and displays a 2D puzzle visualization via cubing.js CDN based on event and scramble.",
  "frontend/src/components/SessionStats.tsx": "Card displaying computed session statistics like current, best, ao5, ao12, and mo3.",
  "frontend/src/components/SolveHistory.tsx": "Scrollable grid showing solve history entries with formatted times and DNF indicators.",
  "frontend/src/components/TimerDisplay.tsx": "Displays the timer UI, formatting time and inspection countdown based on state with pointer event handlers.",
  "frontend/src/components/TimerScreen.tsx": "Main timer screen managing event selection, scrambles, solve history, session persistence, and transitions to practice mode.",
  "frontend/src/config/iiOrigins.ts": "Defines stable and alternative Internet Identity derivation origins for consistent user principal mapping.",
  "frontend/src/hooks/useActor.ts": "Creates a backend actor tied to the current Internet Identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useEmailPasswordAuth.tsx": "Empty file.",
  "frontend/src/hooks/useFirstVisitLoginPrompt.ts": "Empty file.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, loading stored identities, handling login flow, and exposing identity state.",
  "frontend/src/hooks/usePracticeScrambles.ts": "Generates and cycles through multiple cubing scrambles for an event using cubing.js.",
  "frontend/src/hooks/usePracticeSessionPersistence.ts": "Persists practice session state in localStorage with load, save, and clear helpers.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder indicating no backend query hooks are needed.",
  "frontend/src/hooks/useWcaCompetitionDetails.ts": "Fetches and caches details for a specific WCA competition via the WCA API.",
  "frontend/src/hooks/useWcaScramble.ts": "Generates a single scramble for an event using cubing.js and tracks generation status.",
  "frontend/src/hooks/useWcaTimerControls.ts": "Implements WCA-style timer and inspection logic with audio cues and state transitions.",
  "frontend/src/hooks/useWcaUpcomingCompetitions.ts": "Fetches upcoming WCA competitions and filters out past events.",
  "frontend/src/index.css": "Defines Tailwind-based theme variables and utility classes for timer and practice UI styling.",
  "frontend/src/lib/inspectionAudio.ts": "Provides Web Audio API utilities for playing inspection warning beeps.",
  "frontend/src/lib/sessionCookie.ts": "Saves and loads session data in a cookie with basic validation.",
  "frontend/src/lib/sessionStats.ts": "Computes session timing statistics including current, best, mo3, ao5, and ao12 from solve history.",
  "frontend/src/lib/wcaCountries.ts": "Resolves country codes to names and extracts unique sorted country entries from competitions.",
  "frontend/src/lib/wcaEvents.ts": "Defines WCA event metadata including IDs, names, and scramble event codes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider.",
  "frontend/src/types/cubing-cdn.d.ts": "Type declarations for scramble generation from the cubing.net CDN module.",
  "frontend/src/types/cubing.d.ts": "Type definitions for Alg and TwistyPlayer from cubing.net modules.",
  "frontend/src/types/solves.ts": "Defines solve entry types and utilities for formatting display and numeric times.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, storing, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme, colors, fonts, plugins, and content paths.",
  "project_state.json": "Stores project metadata, feature requirements, and architectural notes for the WCA practice session app."
}