{
  "backend/main.mo": "Actor storing user profiles with access control, allowing users to save and query their own profiles and admins to view others' profiles.",
  "feature_evidence.json": "Lists feature evidence reports mapping features to related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten short summaries of many frontend files, including components, hooks, config files, and utilities.",
  "frontend/index.css": "Tailwind base styles defining light and dark theme variables and global background/foreground styling.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Wraps TimerScreen with theme and email/password authentication providers.",
  "frontend/src/components/EventSelector.tsx": "Dropdown component for selecting WCA events, disabled during active solves.",
  "frontend/src/components/LoginModal.tsx": "Email/password login and signup modal with validation, error handling, and mode switching.",
  "frontend/src/components/ScramblePanel.tsx": "Displays the current scramble with a refresh button and loading state.",
  "frontend/src/components/ScrambleVisualizer.tsx": "Loads and renders 2D puzzle visualizations using TwistyPlayer from a CDN with error and loading handling.",
  "frontend/src/components/SessionStats.tsx": "Shows computed session statistics like best, ao5, ao12, mo3 in a responsive grid card.",
  "frontend/src/components/SolveHistory.tsx": "Scrollable grid showing recent solves with display times and DNF highlighting.",
  "frontend/src/components/TimerDisplay.tsx": "UI component that formats and displays timer, inspection, and final result states with color and text indicators.",
  "frontend/src/components/TimerScreen.tsx": "Main timer page managing events, scrambles, solves, session persistence, and authentication modal behavior.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useEmailPasswordAuth.tsx": "Handles email/password auth via backend actor, managing session tokens, user state, and restoring sessions.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login, identity loading, and state management via context and AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file noting that scrambling is done client‑side.",
  "frontend/src/hooks/useWcaScramble.ts": "Generates and stores WCA scrambles using cubing.js with async loading and regeneration logic.",
  "frontend/src/hooks/useWcaTimerControls.ts": "Manages timer state, inspection countdown with warnings, and computing final solve results.",
  "frontend/src/index.css": "Defines Tailwind layers and theme variables including light/dark mode and timer-specific OKLCH color tokens, plus custom utility classes for timer colors.",
  "frontend/src/lib/inspectionAudio.ts": "Implements a Web Audio API helper that initializes an audio context and plays short beeps for 8‑second and 5‑second inspection warnings.",
  "frontend/src/lib/sessionCookie.ts": "Provides functions to save and load session data in a cookie, storing event, scramble, and solve history.",
  "frontend/src/lib/sessionStats.ts": "Computes current, best, and rolling averages (ao5, ao12, mo3) from a list of solves, handling DNFs and plus‑twos.",
  "frontend/src/lib/wcaEvents.ts": "Exports WCA event metadata with IDs, names, and scramble event codes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and the Internet Identity provider, loading global styles.",
  "frontend/src/types/cubing.d.ts": "Provides TypeScript declarations for external cubing scramble and twisty player modules.",
  "frontend/src/types/solves.ts": "Defines solve types and utilities to compute display and numeric times including plus‑two and DNF handling.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for extracting, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, typography, animations, and exposing theme values based on CSS variables including timer colors.",
  "project_state.json": "Describes project context and requirements for replacing Internet Identity with a custom email/password authentication system using a Motoko backend."
}