{
  "backend/main.mo": "Empty Motoko canister actor with no methods.",
  "feature_evidence.json": "Feature evidence report detailing three login‑modal-related features and the frontend files they affect.",
  "frontend-file-summaries.txt": "Prewritten summaries of all major frontend files for build planning.",
  "frontend/index.css": "Tailwind base styles defining light/dark theme CSS variables and global layout rules.",
  "frontend/index.html": "HTML entry point containing root div and loading the Vite main.tsx script.",
  "frontend/src/App.tsx": "Wraps TimerScreen in a ThemeProvider to enable system/dark theme switching.",
  "frontend/src/components/EventSelector.tsx": "Dropdown component for selecting a WCA event, using shadcn-ui Select.",
  "frontend/src/components/LoginModal.tsx": "Reusable Internet Identity login modal that triggers login on button click and auto-closes on successful authentication.",
  "frontend/src/components/ScramblePanel.tsx": "Displays current scramble with a refresh button and generation status.",
  "frontend/src/components/ScrambleVisualizer.tsx": "Loads and renders 2D puzzle visualization via TwistyPlayer from CDN with error and loading handling.",
  "frontend/src/components/SessionStats.tsx": "Displays computed session stats (current, best, ao5, ao12, mo3) in a responsive grid.",
  "frontend/src/components/SolveHistory.tsx": "Scrollable grid showing recent solve results with DNF highlighting and solve numbering.",
  "frontend/src/components/TimerDisplay.tsx": "Displays formatted timer or inspection time with state-based colors and text, handling pointer events and final result formatting.",
  "frontend/src/components/TimerScreen.tsx": "Main timer screen managing events, scrambles, solves, authentication prompts, and session persistence.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current Internet Identity and invalidates related queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, login/logout handling, and persistence of identities via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file indicating no backend queries are used.",
  "frontend/src/hooks/useWcaScramble.ts": "Generates and manages WCA scrambles using cubing.js with async loading and regeneration logic.",
  "frontend/src/hooks/useWcaTimerControls.ts": "Controls timer and inspection states, tracking timing, warnings, and final results with animation frame updates.",
  "frontend/src/index.css": "Defines Tailwind base styles and color themes for timer UI, including light/dark mode and timer-specific colors.",
  "frontend/src/lib/inspectionAudio.ts": "Implements Web Audio API beeps for inspection warnings with lazy initialization and error handling.",
  "frontend/src/lib/sessionCookie.ts": "Handles saving and loading session data to a browser cookie, including JSON encoding and basic validation.",
  "frontend/src/lib/sessionStats.ts": "Computes session statistics like current time, best time, ao5, ao12, and mo3 using solve history.",
  "frontend/src/lib/wcaEvents.ts": "Defines the list of supported WCA events with IDs, names, and scramble identifiers.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider.",
  "frontend/src/types/cubing.d.ts": "Provides TypeScript declarations for cubing.net scramble and twisty modules.",
  "frontend/src/types/solves.ts": "Defines solve entry types and helpers for formatting or extracting solve times.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme, colors, plugins, and animations for the frontend.",
  "project_state.json": "Stores project metadata, existing features, requirements, and pending authentication-related feature requests."
}