{
  "backend/main.mo": "Minimal Motoko canister entrypoint containing an empty actor definition.",
  "feature_evidence.json": "Feature evidence report mapping features to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend files, hooks, components, and configs.",
  "frontend/index.css": "Tailwind base and custom theme variables defining light/dark mode color tokens and global styles.",
  "frontend/index.html": "HTML root document mounting the React app and loading the Vite entrypoint.",
  "frontend/src/App.tsx": "Wraps the TimerScreen component with a ThemeProvider to enable dark mode and system theming.",
  "frontend/src/components/EventSelector.tsx": "Dropdown component for selecting WCA events, disabled during active solves.",
  "frontend/src/components/ScramblePanel.tsx": "Card UI showing the current scramble with a button to generate a new one.",
  "frontend/src/components/ScrambleVisualizer.tsx": "Loads and displays a 2D puzzle visualization using TwistyPlayer from a CDN based on the selected event.",
  "frontend/src/components/SessionStats.tsx": "Displays computed session statistics such as current, best, ao5, ao12, and mo3 in a card layout.",
  "frontend/src/components/SolveHistory.tsx": "Scrollable grid showing past solves with numbering and DNF/penalty indicators.",
  "frontend/src/components/TimerDisplay.tsx": "Main timer UI rendering inspection countdown, solve time, state labels, and handling pointer interactions.",
  "frontend/src/components/TimerScreen.tsx": "Main timer screen managing event selection, scrambles, solves, stats, and session persistence.",
  "frontend/src/hooks/useActor.ts": "Creates and updates a backend actor based on Internet Identity, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login state, loading, and context management using Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file indicating no backend queries are used.",
  "frontend/src/hooks/useWcaScramble.ts": "Generates WCA scrambles via cubing.js and tracks scramble state and loading status.",
  "frontend/src/hooks/useWcaTimerControls.ts": "Implements full WCA-style timer logic including inspection timing, warnings, running, and stopping.",
  "frontend/src/index.css": "Tailwind CSS config defining color themes and utility classes for the timer UI.",
  "frontend/src/lib/inspectionAudio.ts": "Web Audio helper that plays 8s and 5s inspection warnings via generated beeps.",
  "frontend/src/lib/sessionCookie.ts": "Saves and loads session data to a cookie, including event, scramble, and solves.",
  "frontend/src/lib/sessionStats.ts": "Computes session statistics like current time, best, ao5, ao12, and mo3 from solve history.",
  "frontend/src/lib/wcaEvents.ts": "Defines the WCAEvent interface and exports a list of official WCA events with IDs, names, and scramble event codes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/types/cubing.d.ts": "Provides TypeScript declarations for cubing.net scramble and twisty player modules.",
  "frontend/src/types/solves.ts": "Defines solve and inspection types plus helpers to format display and numeric times with penalties.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, plugins, animations, and content paths.",
  "project_state.json": "Describes project state, known issues, and existing feature requirements for timer inspection and warning fixes."
}