{
  "backend/main.mo": "Implements insecure demo email/password auth with session tokens, credential lookup, signup/login flows, and access‑control role assignment.",
  "feature_evidence.json": "Provides feature evidence metadata describing two Internet Identity configuration features and their associated components, files, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for many frontend files, describing their roles in the timer, scramble system, UI, and authentication.",
  "frontend/index.css": "Defines Tailwind base styles and OKLCH color variables for light/dark themes used across the app.",
  "frontend/index.html": "Minimal HTML entry point that loads the React app via main.tsx.",
  "frontend/src/App.tsx": "Wraps the main TimerScreen component with theme and email/password auth providers.",
  "frontend/src/components/EventSelector.tsx": "Event dropdown component for choosing WCA events with disabled state support.",
  "frontend/src/components/LoginModal.tsx": "Email/password login and signup modal with validation, error handling, and mode switching.",
  "frontend/src/components/ScramblePanel.tsx": "Displays the current scramble with a refresh button and loading state.",
  "frontend/src/components/ScrambleVisualizer.tsx": "Loads and renders a 2D puzzle visualization using TwistyPlayer from a CDN with error and loading handling.",
  "frontend/src/components/SessionStats.tsx": "Displays session stats in a card by mapping stat fields into a grid layout.",
  "frontend/src/components/SolveHistory.tsx": "Renders a scrollable grid of past solves with formatted times and DNF/+2 indicators.",
  "frontend/src/components/TimerDisplay.tsx": "Shows formatted timer or inspection time with state‑based text and colors, handling pointer events for starting and stopping the timer.",
  "frontend/src/components/TimerScreen.tsx": "Main timer page managing event selection, scrambles, solves, session persistence, and login modal behavior.",
  "frontend/src/config/iiOrigins.ts": "Defines Internet Identity derivation origin and alternative origins for stable principal mapping.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to Internet Identity, invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useEmailPasswordAuth.tsx": "Manages email/password auth, session restoration, and token storage using the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, loading stored identities and exposing login/clear functions via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file noting no backend queries are used.",
  "frontend/src/hooks/useWcaScramble.ts": "Generates and stores WCA scrambles using cubing.js, exposing scramble state and a generation function.",
  "frontend/src/hooks/useWcaTimerControls.ts": "React hook managing WCA-style timer state, inspection countdown, audio warnings, and timing logic.",
  "frontend/src/index.css": "Tailwind base styles and theme variables defining light/dark color palettes and timer-specific colors.",
  "frontend/src/lib/inspectionAudio.ts": "Utility using Web Audio API to initialize audio and play inspection warning beeps.",
  "frontend/src/lib/sessionCookie.ts": "Functions to save and load session data in cookies with basic validation.",
  "frontend/src/lib/sessionStats.ts": "Computes session statistics such as current time, best, ao5, ao12, and mo3.",
  "frontend/src/lib/wcaEvents.ts": "Defines metadata for supported WCA events and their scramble IDs.",
  "frontend/src/main.tsx": "App entry point setting up React root, queries, identity provider, and global styles.",
  "frontend/src/types/cubing.d.ts": "Type declarations for cubing.net scramble and twisty modules.",
  "frontend/src/types/solves.ts": "Types for solves and helpers to format display time and compute numeric time including penalties.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration with custom colors, typography, animations, and timer theme extensions.",
  "project_state.json": "Tracks project state for migrating Internet Identity to mcubes.net, adding admin and email/password auth features, and fixing missing backend methods. Includes architectural notes, known issues, existing features, and new feature requests."
}