{
  "backend/main.mo": "Defines authentication logic with email/password signup, login, session handling, and role assignment using access control and in‑memory maps.",
  "feature_evidence.json": "Declares feature evidence linking frontend files to authentication updates and actor type regeneration requirements.",
  "frontend-file-summaries.txt": "Contains human‑written summaries of numerous frontend files describing their purpose and functionality.",
  "frontend/index.css": "Tailwind base styles defining color tokens, dark mode values, and global background/foreground theming.",
  "frontend/index.html": "HTML entry point that loads the React app via main.tsx.",
  "frontend/src/App.tsx": "Wraps the TimerScreen component with theme and email/password auth providers.",
  "frontend/src/components/EventSelector.tsx": "Renders a dropdown for selecting WCA events, disabled during solves.",
  "frontend/src/components/LoginModal.tsx": "Modal for login/signup with validation, error display, and interaction with the email/password auth hook.",
  "frontend/src/components/ScramblePanel.tsx": "Card showing the current scramble with a button to generate a new one and loading state handling.",
  "frontend/src/components/ScrambleVisualizer.tsx": "Uses TwistyPlayer from a CDN to render 2D puzzle visualizations for scrambles with basic error handling.",
  "frontend/src/components/SessionStats.tsx": "Displays session stat values in a card using provided stats object.",
  "frontend/src/components/SolveHistory.tsx": "Renders a scrollable grid of past solves with formatted times and outcome badges.",
  "frontend/src/components/TimerDisplay.tsx": "Shows the timer UI, formatting time based on state and handling pointer events.",
  "frontend/src/components/TimerScreen.tsx": "Main timer screen managing scramble generation, solves list, authentication modal, and session persistence.",
  "frontend/src/config/iiOrigins.ts": "Defines stable and alternative Internet Identity derivation origins.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity and refreshes dependent queries.",
  "frontend/src/hooks/useEmailPasswordAuth.tsx": "Provides email/password auth context with signup, login, logout, and session restoration.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity provider and hook for managing identity, login, and state restoration.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder noting no backend queries are used.",
  "frontend/src/hooks/useWcaScramble.ts": "Generates and stores WCA scrambles using cubing.js, with loading state and event-based regeneration.",
  "frontend/src/hooks/useWcaTimerControls.ts": "React hook managing WCA-style timer states, inspection countdown, audio warnings, and solve timing.",
  "frontend/src/index.css": "Tailwind base styles and custom OKLCH color variables for light/dark themes and timer UI.",
  "frontend/src/lib/inspectionAudio.ts": "Utility handling Web Audio API initialization and playing 8s/5s inspection warning beeps.",
  "frontend/src/lib/sessionCookie.ts": "Saves and loads session data in cookies with JSON encoding and basic validation.",
  "frontend/src/lib/sessionStats.ts": "Calculates session stats including current, best, averages, and mean from solve history.",
  "frontend/src/lib/wcaEvents.ts": "Defines the list of WCA events with IDs, names, and scramble identifiers.",
  "frontend/src/main.tsx": "Application entrypoint mounting React app with query client and identity provider.",
  "frontend/src/types/cubing.d.ts": "Type declarations for cubing.net scramble and twisty player modules.",
  "frontend/src/types/solves.ts": "Defines solve entry types and helpers for formatting and computing effective times.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, storing, and clearing URL parameters with session persistence.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, animations, and enabling plugins.",
  "project_state.json": "Tracks project state, including known issues with silent signup failures and feature requests to align frontend auth flows with updated backend actor methods."
}