{
  "kind": "build_request",
  "title": "Fix WCA inspection countdown progression and 8s/5s warnings; ensure start-on-release and +2/DNF timing rules",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the inspection countdown so it visibly counts down from 15.00 to 0.00 during inspection after the user triggers inspection with a press-and-hold, and ensure the countdown continues updating every frame until inspection ends or the solve starts (no freezing at 15.00).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-8",
          "msg-10"
        ],
        "quotes": [
          "Inspection doesn't work like counting doesn't work and 8 second and 5 second warning not showing with sound",
          "When touch and hold it start but no counting happens.",
          "Counting should work like 15 to 0"
        ]
      },
      "acceptanceCriteria": [
        "On desktop (Space) and mobile (touch/pointer), starting inspection causes the displayed inspection time to decrease smoothly from ~15.00 down to 0.00 without getting stuck.",
        "Inspection countdown updates are not dependent on stale React state (i.e., it continues animating reliably after state transitions).",
        "Starting a solve from inspection stops the inspection countdown updates."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement the inspection warning behavior so that at 8 seconds remaining there is a warning, and when inspection reaches 5 seconds remaining it visibly shows \"5 sec\" and plays the 5-second warning sound; both warnings must reliably trigger once per inspection.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-8"
        ],
        "quotes": [
          "8 second and 5 second warning not showing with sound",
          "warning on 8 sec and when reached 5 it says 5 sec"
        ]
      },
      "acceptanceCriteria": [
        "During inspection, exactly one 8-second warning sound plays when remaining time crosses 8 seconds.",
        "During inspection, exactly one 5-second warning sound plays when remaining time crosses 5 seconds.",
        "When remaining time is at/under 5 seconds (and inspection is still active), the timer UI shows an explicit \"5 sec\" warning text (in English).",
        "Warnings trigger reliably even if the frame timing skips over narrow millisecond windows."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure touch/hold and Spacebar controls follow: the timer starts only after the user releases (not while holding) once armed; during inspection, holding again arms and releasing starts the solve timer.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-9"
        ],
        "quotes": [
          "After releasing timer starts"
        ]
      },
      "acceptanceCriteria": [
        "While holding (armed), the solve timer does not increment.",
        "On release from the armed state, the solve timer starts immediately and increments.",
        "The same behavior works for both pointer (touch/mouse) and Spacebar input."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Apply inspection penalty rules exactly as requested: inspection display counts down to 0.00 (not below), but starting the solve up to 2 seconds after inspection hits 0.00 results in a +2 penalty; starting after that results in DNF.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-8",
          "msg-9"
        ],
        "quotes": [
          "till -2 is +2 and after that dnf",
          "stop at 0 and till -2 is +2 and after that dnf"
        ]
      },
      "acceptanceCriteria": [
        "The inspection timer display never shows negative values; it clamps at 0.00 once inspection time has elapsed.",
        "If the solve is started after inspection time is up but within 2 seconds of inspection reaching 0.00, the recorded solve has inspectionOutcome = \"plus2\" and history/stats display the time with a trailing \"+\".",
        "If the solve is started more than 2 seconds after inspection reaches 0.00, the recorded solve has inspectionOutcome = \"dnf\" and displays as \"DNF\"."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/components/ui or any path listed in frontend.immutablePaths in SYSTEM_CONTEXT.",
    "Keep backend as a single Motoko actor; no new backend services."
  ],
  "nonGoals": [
    "Adding new authentication methods (only Internet Identity is supported).",
    "Adding real-time/networked features (e.g., WebSockets, multiplayer, live leaderboards).",
    "Changing scramble generation logic or adding new WCA events beyond what already exists."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}