{
  "kind": "build_request",
  "title": "Replace Internet Identity flow with custom email/password signup + login (Motoko-backed)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Implement a custom email + password authentication system in the Motoko backend canister, supporting user signup and future login with securely stored credentials (store a per-user salt + password hash; never store plaintext passwords).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-recent-1"
        ],
        "quotes": [
          "Then try using basic login method using email and pass",
          "1. Yes\n2. Yes\n3. Yes signup allows and used for future login",
          "Yes."
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes a `signup` method that creates a new account for an email and password and returns a clear success/error result (e.g., email already exists).",
        "Backend exposes a `login` method that validates email+password and returns a session token (or equivalent) on success and a clear error on failure.",
        "Passwords are not stored in plaintext; stored data includes a salt and a hash derived from the password.",
        "User emails are treated case-insensitively (normalized consistently on both signup and login).",
        "Backend state persists across upgrades using stable storage; add `backend/migration.mo` only if required by existing persisted state (conditional migration policy)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add backend session management for the custom auth system so the frontend can remain logged in across page refreshes using a backend-issued session token, with methods to get the current authenticated user from a token and to log out (invalidate the token).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-recent-1"
        ],
        "quotes": [
          "Yes signup allows and used for future login"
        ]
      },
      "acceptanceCriteria": [
        "Backend issues a unique session token on successful login.",
        "Backend provides a method to validate a session token and return the associated user identity/profile data (at minimum: email and a user id).",
        "Backend provides a logout/invalidate method so a token can be revoked.",
        "Invalid/expired tokens do not authenticate the user and return a clear error result.",
        "Session tokens are not derived directly from the password or stored password hash."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Replace the existing Internet Identity-based login modal UI with an email/password authentication modal that supports both signup and login, and integrate it into `frontend/src/components/TimerScreen.tsx` so it still (a) auto-opens on first visit for unauthenticated users and (b) can be opened via the existing header login icon.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent-1"
        ],
        "quotes": [
          "Completely remove internet identity and yes otpless first",
          "Then try using basic login method using email and pass",
          "Yes."
        ]
      },
      "acceptanceCriteria": [
        "`frontend/src/components/LoginModal.tsx` no longer prompts for Internet Identity and instead provides email + password inputs with clear actions for “Sign up” and “Log in”.",
        "The first-visit behavior remains: on a fresh browser, unauthenticated users see the modal automatically once; dismissing it sets the existing localStorage flag (`wca-timer-first-visit-seen`).",
        "The header login icon in `TimerScreen` opens the same modal on demand when the user is logged out.",
        "All user-facing text in the modal is in English.",
        "Form validation is present (e.g., required fields; basic email format; password minimum length)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Implement a new frontend authentication state layer (new hook/provider) for email/password auth that stores the session token locally, exposes `signup`, `login`, and `logout` actions, and exposes `isAuthenticated` + current user info to the UI without relying on `useInternetIdentity` for application logic.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent-1"
        ],
        "quotes": [
          "Completely remove internet identity",
          "Then try using basic login method using email and pass"
        ]
      },
      "acceptanceCriteria": [
        "A new auth hook/provider exists (new file(s)) that manages: current user (or null), auth status, loading/error states, and actions for signup/login/logout.",
        "On successful login/signup, the session token is persisted in the browser (e.g., localStorage) and the app becomes authenticated without requiring Internet Identity.",
        "On app load/refresh, if a token is present, the frontend attempts to validate it via the backend and restores authenticated state.",
        "Logout clears the stored token and returns the UI to logged-out state.",
        "No changes are requested to immutable files (`frontend/src/main.tsx`, `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useActor.ts`); the new auth layer is used by app components instead."
      ]
    }
  ],
  "constraints": [
    "Do not modify immutable frontend paths: `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, and anything under `frontend/src/components/ui`.",
    "Backend must remain a single Motoko actor in `backend/main.mo`; do not introduce additional backend services.",
    "Do not integrate OTPless or any other third-party authentication provider.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Implementing OTPless authentication.",
    "Integrating Internet Identity as a login option (the UI/flow should move to email/password).",
    "Adding external databases or any non-Motoko backend dependencies.",
    "Adding email verification, password reset via email, or multi-factor authentication."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}