{
  "kind": "build_request",
  "title": "Reset inspection timer to 15 seconds after every solve",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-5",
      "text": "Reset the inspection countdown back to 15.00 seconds immediately after every solve is completed (i.e., when the timer transitions into the \"stopped\" state), regardless of what the inspection countdown value was previously.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Starts from 15 if stopeed at 11 se and it restarts from  15 once solve is done.",
          "After solve event",
          "resetting the inspection timer back to 15 sec"
        ]
      },
      "acceptanceCriteria": [
        "Given an inspection is started and the countdown reaches any value (e.g., 11 seconds remaining), when the user completes a solve (timer stops and a result is recorded), the internal inspection countdown state is reset to exactly 15,000ms.",
        "After a solve completes, starting the next inspection always begins from 15.00 seconds and does not resume from the previous inspection’s remaining time.",
        "This behavior works for both Spacebar and touch/pointer interactions."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Ensure the inspection-warning state is also reset after each solve completion so the 8-second and 5-second inspection warnings can trigger normally on the next inspection.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "After solve event"
        ]
      },
      "acceptanceCriteria": [
        "After a solve completes, starting the next inspection can play the 8-second warning once and the 5-second warning once as the countdown crosses those thresholds, even if warnings were triggered during the previous inspection.",
        "No inspection warning audio plays immediately upon solve completion; warnings only occur during a subsequent inspection countdown."
      ]
    }
  ],
  "constraints": [
    "Do not edit files in frontend/src/components/ui (read-only).",
    "Do not edit frontend/src/hooks/useInternetIdentity.ts or frontend/src/hooks/useActor.ts (immutable paths).",
    "Keep all backend logic in the single Motoko actor (backend/main.mo); no backend changes are required for this request."
  ],
  "nonGoals": [
    "Do not change inspection penalty rules (+2/DNF thresholds) beyond what already exists.",
    "Do not change solve history, session stats, scramble generation, or event selection behavior."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}