{
  "kind": "build_request",
  "title": "Fix email/password signup doing nothing by aligning frontend auth calls with backend actor methods",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the Motoko backend email/password authentication API so the actor exposes `signup`, `login`, `validateSession`, and `logout` methods with stable, structured return types compatible with the frontend’s expectations (i.e., Result-style responses that include a session token and user info on success, and an error message on failure).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Tried to create account Nothing happens no error or anything"
        ]
      },
      "acceptanceCriteria": [
        "Backend canister exports callable methods named `signup`, `login`, `validateSession`, and `logout` (no \"is not a function\" errors from the frontend).",
        "`signup(email, password)` returns success with a session token and user identifier when the email is not already registered, and returns a clear error message when it is already registered.",
        "`login(email, password)` returns success with a session token and user info when credentials are valid, and a clear error message when invalid.",
        "`validateSession(token)` returns success with user info for a valid/unexpired token, and a clear failure response for invalid/expired tokens.",
        "`logout(token)` invalidates the session token so subsequent `validateSession(token)` calls fail."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the React email/password auth hook to match the backend’s actual return types for `signup`, `login`, `validateSession`, and `logout`, and ensure all failures surface a user-visible error in the login/signup modal (no silent failures).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Tried to create account Nothing happens no error or anything"
        ]
      },
      "acceptanceCriteria": [
        "Clicking “Sign Up” shows a loading state immediately and then either authenticates the user (closing the modal) or displays a readable error message inside the modal.",
        "If the backend call throws (network/canister error), the error is caught and shown in the modal rather than failing silently.",
        "Session restoration on page load uses `validateSession` and correctly sets authenticated state when the stored token is valid; invalid tokens are removed from localStorage.",
        "No uncaught exceptions are produced in the browser console during signup/login/restore flows."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Regenerate/update the frontend backend-actor type declarations so the compiled frontend actor type includes the newly supported `signup`, `login`, `validateSession`, and `logout` methods (eliminating runtime mismatches between declared and deployed canister interfaces).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "Try again"
        ]
      },
      "acceptanceCriteria": [
        "Frontend build output includes the auth methods on the actor instance created by `createActorWithConfig`.",
        "Manual test: opening the signup modal and submitting valid inputs performs a canister call (visible in network/agent logs) rather than failing due to missing methods."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under `frontend/src/hooks/useActor.ts`, `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/main.tsx`, or anything in `frontend/src/components/ui` (they are immutable).",
    "Keep all backend logic in the single Motoko actor (`backend/main.mo`); only add `backend/migration.mo` if a state migration is strictly necessary."
  ],
  "nonGoals": [
    "Implementing secure password hashing, email verification, password reset, or production-grade account security (current flow is explicitly demo/insecure).",
    "Adding third-party authentication providers beyond Internet Identity."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}