{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Reset inspection countdown and warnings after each solve",
  "requirements": [
    {
      "id": "REQ-5",
      "summary": "Reset the inspection countdown state to 15.00s immediately when a solve completes (timer enters the \"stopped\" state), so the next inspection always starts from 15.00s.",
      "acceptanceCriteria": [
        "Given an inspection is started and the countdown reaches any value (e.g., 11 seconds remaining), when the user completes a solve (timer stops and a result is recorded), the internal inspection countdown state is reset to exactly 15,000ms.",
        "After a solve completes, starting the next inspection always begins from 15.00 seconds and does not resume from the previous inspection’s remaining time.",
        "This behavior works for both Spacebar and touch/pointer interactions."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useWcaTimerControls.ts",
          "operation": "modify",
          "description": "Update the solve-completion logic (when transitioning into the \"stopped\" state) to immediately reset inspection countdown-related state back to 15,000ms (including any internal remaining-time tracking) so subsequent inspections always begin at 15.00s for both keyboard (Space) and pointer/touch flows."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Reset inspection warning state after each solve so 8s and 5s warnings can trigger normally on the next inspection only.",
      "acceptanceCriteria": [
        "After a solve completes, starting the next inspection can play the 8-second warning once and the 5-second warning once as the countdown crosses those thresholds, even if warnings were triggered during the previous inspection.",
        "No inspection warning audio plays immediately upon solve completion; warnings only occur during a subsequent inspection countdown."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useWcaTimerControls.ts",
          "operation": "modify",
          "description": "Ensure that when a solve completes (timer enters \"stopped\"), the internal inspection warning flags/state are cleared (so 8s/5s warnings can fire again on the next inspection), without triggering any warning audio during the stop transition."
        }
      ]
    }
  ]
}