{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Email/password auth modal + frontend auth state (session-token based)",
  "requirements": [
    {
      "id": "REQ-3",
      "summary": "Replace the Internet Identity login modal with an email/password modal (signup + login) and integrate it into TimerScreen first-visit and header-icon flows.",
      "acceptanceCriteria": [
        "`frontend/src/components/LoginModal.tsx` no longer prompts for Internet Identity and instead provides email + password inputs with clear actions for “Sign up” and “Log in”.",
        "The first-visit behavior remains: on a fresh browser, unauthenticated users see the modal automatically once; dismissing it sets the existing localStorage flag (`wca-timer-first-visit-seen`).",
        "The header login icon in `TimerScreen` opens the same modal on demand when the user is logged out.",
        "All user-facing text in the modal is in English.",
        "Form validation is present (e.g., required fields; basic email format; password minimum length)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/LoginModal.tsx",
          "operation": "modify",
          "description": "Replace Internet Identity UI with an email/password form supporting both Sign up and Log in, wired to the new email/password auth hook actions; add client-side validation (required, basic email format, minimum password length), loading/disabled states, and English-only copy. Keep the Dialog + Button patterns from shadcn-ui; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/TimerScreen.tsx",
          "operation": "modify",
          "description": "Replace Internet Identity-derived authentication checks with the new email/password auth state (`isAuthenticated`, `isInitializing/loading` as applicable) while preserving: (1) first-visit auto-open behavior using `wca-timer-first-visit-seen`, and (2) header login icon opening the same LoginModal when logged out."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Add a new frontend auth provider/hook for email/password auth that persists a backend-issued session token and restores auth state on refresh without using useInternetIdentity for app logic.",
      "acceptanceCriteria": [
        "A new auth hook/provider exists (new file(s)) that manages: current user (or null), auth status, loading/error states, and actions for signup/login/logout.",
        "On successful login/signup, the session token is persisted in the browser (e.g., localStorage) and the app becomes authenticated without requiring Internet Identity.",
        "On app load/refresh, if a token is present, the frontend attempts to validate it via the backend and restores authenticated state.",
        "Logout clears the stored token and returns the UI to logged-out state.",
        "No changes are requested to immutable files (`frontend/src/main.tsx`, `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useActor.ts`); the new auth layer is used by app components instead."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useEmailPasswordAuth.tsx",
          "operation": "create",
          "description": "Create a React context/provider + hook that manages email/password authentication state: `user` (at minimum: email and user id), `isAuthenticated`, `isLoading`/`isRestoringSession`, `error`, and actions `signup`, `login`, `logout`. Persist the session token to localStorage and, on app load, if a token exists, call backend capability to validate it and restore user state. Use `useActor` to obtain an actor for calling backend capabilities (do not modify `useActor`)."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wrap the existing app content (TimerScreen) with the new EmailPasswordAuthProvider so that authentication state and actions are available to UI components without relying on Internet Identity for application logic."
        }
      ]
    }
  ]
}