{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Align React email/password auth hook with backend actor auth methods and regenerated types",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Update the email/password auth hook to use the backend actor’s actual auth return types and ensure all failures are surfaced in the login/signup modal (no silent failures).",
      "acceptanceCriteria": [
        "Clicking “Sign Up” shows a loading state immediately and then either authenticates the user (closing the modal) or displays a readable error message inside the modal.",
        "If the backend call throws (network/canister error), the error is caught and shown in the modal rather than failing silently.",
        "Session restoration on page load uses `validateSession` and correctly sets authenticated state when the stored token is valid; invalid tokens are removed from localStorage.",
        "No uncaught exceptions are produced in the browser console during signup/login/restore flows."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useEmailPasswordAuth.tsx",
          "operation": "modify",
          "description": "Replace the current `Ok/Err`-style parsing and `any` actor calls with parsing for the declared `SignupResult`/`LoginResult` (`__kind__: 'success' | 'failure'`) and `SessionValidationResult` (`isValid` + optional `user/session`). Ensure: (1) restore flow calls `validateSession` and clears localStorage on invalid/expired tokens, (2) signup/login failures always set a readable `error` state, (3) thrown exceptions are caught and mapped to user-visible errors, (4) logout clears local token and user state even if the backend call fails."
        },
        {
          "path": "frontend/src/components/LoginModal.tsx",
          "operation": "modify",
          "description": "Ensure the modal always displays hook-provided errors (including thrown-call errors) and never fails silently. Clear prior validation/UI error state on submit, keep the existing loading/disabled behavior, and ensure failed signup/login results render a readable message inside the modal."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Update frontend actor type declarations so the compiled actor type includes `signup`, `login`, `validateSession`, and `logout` and remove runtime/type mismatches.",
      "acceptanceCriteria": [
        "Frontend build output includes the auth methods on the actor instance created by `createActorWithConfig`.",
        "Manual test: opening the signup modal and submitting valid inputs performs a canister call (visible in network/agent logs) rather than failing due to missing methods."
      ],
      "file_operations": [
        {
          "path": "frontend/src/backend.d.ts",
          "operation": "modify",
          "description": "Regenerate/align the frontend canister type declarations so `backendInterface` accurately includes `signup`, `login`, `validateSession`, and `logout` with the structured return types expected by the frontend. This file should be the source of truth used by TypeScript during build to prevent missing-method runtime mismatches."
        },
        {
          "path": "frontend/src/hooks/useEmailPasswordAuth.tsx",
          "operation": "modify",
          "description": "Remove `(actor as any)` usage and rely on the typed actor interface from the generated declarations (via the actor returned by `useActor`). This forces compile-time alignment with the regenerated declarations and prevents calling non-existent methods at runtime."
        }
      ]
    }
  ]
}