{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Switch Internet Identity derivation origin to mcubes.net and add future-proof origin configuration (frontend-only)",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Update frontend configuration so Internet Identity authentication uses mcubes.net as the derivation origin shown to users and remains compatible with existing actor creation after II login.",
      "acceptanceCriteria": [
        "Internet Identity login popup displays `mcubes.net` (or the mcubes.net origin) when users authenticate.",
        "The app continues to function with Internet Identity after the domain change (actor creation in `frontend/src/hooks/useActor.ts` still succeeds after II login)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/config.ts",
          "operation": "modify",
          "description": "Update `loadConfig()` (from the core-infrastructure configuration layer) so the resolved `ii_derivation_origin` defaults to the mcubes.net origin and can be overridden via the existing environment/config mechanism. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/backend.d.ts",
          "operation": "modify",
          "description": "Align the generated/declared backend interface typing expectations used by the frontend with the configured Internet Identity flow as needed (e.g., ensure no type-level drift in actor creation assumptions). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add a clear frontend configuration point for stable Internet Identity derivation origin and alternative origins to preserve principals across future domain changes, without modifying the immutable `useInternetIdentity` hook beyond its existing config consumption.",
      "acceptanceCriteria": [
        "Frontend config supports setting `ii_derivation_origin` to a stable value that can remain constant across future domain changes.",
        "Project includes a clear, implemented configuration point for listing/using alternative origins so that moving from `mcubes.net` to a future domain does not change the user’s principal (when configured).",
        "No changes are made to `frontend/src/hooks/useInternetIdentity.ts` beyond consuming the config it already loads (i.e., keep the immutable hook file intact if it is on the immutable list in this environment)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/config.ts",
          "operation": "modify",
          "description": "Extend the config shape returned by `loadConfig()` to include an explicit, documented-in-code configuration field for Internet Identity alternative origins (e.g., `ii_alternative_origins`) while keeping `ii_derivation_origin` stable; ensure the hook continues to only consume `config.ii_derivation_origin`. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/config/iiOrigins.ts",
          "operation": "create",
          "description": "Add a dedicated, single-responsibility module exporting the stable `ii_derivation_origin` default and an `ii_alternative_origins` list used by `loadConfig()` to centralize future domain-change configuration. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/main.tsx",
          "operation": "modify",
          "description": "Wire a lightweight startup-time validation/logging step (non-blocking) that reads the resolved config and warns in development if the current `window.location.origin` is not present in the configured alternative origins list, aiding safe future domain migrations without changing `useInternetIdentity.ts`. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}